CSI API ETABS v1
cPropMaterial.SetMPIsotropic Method
 Sets the material directional symmetry type to isotropic, and assigns the isotropic mechanical properties.
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int SetMPIsotropic(
	string Name,
	double E,
	double U,
	double A,
	double Temp = 0
)
Function SetMPIsotropic (
	Name As String,
	E As Double,
	U As Double,
	A As Double,
	Optional Temp As Double = 0
) As Integer
Dim instance As cPropMaterial
Dim Name As String
Dim E As Double
Dim U As Double
Dim A As Double
Dim Temp As Double
Dim returnValue As Integer
returnValue = instance.SetMPIsotropic(Name,
	E, U, A, Temp)
int SetMPIsotropic(
	String^ Name,
	double E,
	double U,
	double A,
	double Temp = 0
)
abstract SetMPIsotropic :
        Name : string *
        E : float *
        U : float *
        A : float *
        ?Temp : float
(* Defaults:
        let _Temp = defaultArg Temp 0
*)
-> int
Parameters
Name
Type: System.String
The name of an existing material property.
E
Type: System.Double
The modulus of elasticity. [F/L2]
U
Type: System.Double
Poisson’s ratio.
A
Type: System.Double
The thermal coefficient. [1/T]
Temp (Optional)
Type: System.Double
The temperature at which the specified data applies. The temperature must have been defined previously for the material.
This item applies only if the specified material has properties that are temperature dependent. That is, it applies only if properties are specified for the material at more than one temperature.
Return Value
Type: Int32
Returns zero if the data is successfully assigned; otherwise it returns a nonzero value.
Remarks
Examples
Public Sub Example()
       Dim SapModel As cSapModel
       Dim EtabsObject As cOAPI
       Dim ret As Integer = -1
   'create ETABS object
       Dim myHelper as cHelper = New Helper
       EtabsObject = myHelper.CreateObjectProgID("CSI.ETABS.API.ETABSObject")
   'start ETABS application
       ret = EtabsObject.ApplicationStart()
   'create SapModel object
       SapModel = EtabsObject.SapModel
   'initialize model
       ret = SapModel.InitializeNewModel()
   'create steel deck template model
       ret = SapModel.File.NewSteelDeck(4,12,12,4,4,24,24)
   'initialize new material property
       ret = SapModel.PropMaterial.SetMaterial("Steel", eMatType.Steel)
   'assign isotropic mechanical properties
       ret = SapModel.PropMaterial.SetMPIsotropic("Steel", 29500, 0.25, 6E-06)
   'close ETABS
       EtabsObject.ApplicationExit(False)
   'clean up variables
       SapModel = Nothing
       EtabsObject = Nothing
   End Sub
See Also
Reference
cPropMaterial Interface
ETABSv1 Namespace